OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f85j94.c
__at(0x0E40) __sfr RPINR44_45;
__at(0x0E40) volatile __RPINR44_45bits_t RPINR44_45bits;

__at(0x0E41) __sfr RPINR46_47;
__at(0x0E41) volatile __RPINR46_47bits_t RPINR46_47bits;

__at(0x0E42) __sfr RPINR48_49;
__at(0x0E42) volatile __RPINR48_49bits_t RPINR48_49bits;

__at(0x0E43) __sfr RPINR50_51;
__at(0x0E43) volatile __RPINR50_51bits_t RPINR50_51bits;

__at(0x0E44) __sfr RPINR52_53;
__at(0x0E44) volatile __RPINR52_53bits_t RPINR52_53bits;

__at(0x0E45) __sfr ANCON3;
__at(0x0E45) volatile __ANCON3bits_t ANCON3bits;

__at(0x0E46) __sfr ANCON2;
__at(0x0E46) volatile __ANCON2bits_t ANCON2bits;

__at(0x0E47) __sfr ANCON1;
__at(0x0E47) volatile __ANCON1bits_t ANCON1bits;

__at(0x0E48) __sfr ADCBUF1;

__at(0x0E48) __sfr ADCBUF1L;

__at(0x0E49) __sfr ADCBUF1H;

__at(0x0E4A) __sfr ADCBUF2;

__at(0x0E4A) __sfr ADCBUF2L;

__at(0x0E4B) __sfr ADCBUF2H;

__at(0x0E4C) __sfr ADCBUF3;

__at(0x0E4C) __sfr ADCBUF3L;

__at(0x0E4D) __sfr ADCBUF3H;

__at(0x0E4E) __sfr ADCBUF4;

__at(0x0E4E) __sfr ADCBUF4L;

__at(0x0E4F) __sfr ADCBUF4H;

__at(0x0E50) __sfr ADCBUF5;

__at(0x0E50) __sfr ADCBUF5L;

__at(0x0E51) __sfr ADCBUF5H;

__at(0x0E52) __sfr ADCBUF6;

__at(0x0E52) __sfr ADCBUF6L;

__at(0x0E53) __sfr ADCBUF6H;

__at(0x0E54) __sfr ADCBUF7;

__at(0x0E54) __sfr ADCBUF7L;

__at(0x0E55) __sfr ADCBUF7H;

__at(0x0E56) __sfr ADCBUF8;

__at(0x0E56) __sfr ADCBUF8L;

__at(0x0E57) __sfr ADCBUF8H;

__at(0x0E58) __sfr ADCBUF9;

__at(0x0E58) __sfr ADCBUF9L;

__at(0x0E59) __sfr ADCBUF9H;

__at(0x0E5A) __sfr ADCBUF10;

__at(0x0E5A) __sfr ADCBUF10L;

__at(0x0E5B) __sfr ADCBUF10H;

__at(0x0E5C) __sfr ADCBUF11;

__at(0x0E5C) __sfr ADCBUF11L;

__at(0x0E5D) __sfr ADCBUF11H;

__at(0x0E5E) __sfr ADCBUF12;

__at(0x0E5E) __sfr ADCBUF12L;

__at(0x0E5F) __sfr ADCBUF12H;

__at(0x0E60) __sfr ADCBUF13;

__at(0x0E60) __sfr ADCBUF13L;

__at(0x0E61) __sfr ADCBUF13H;

__at(0x0E62) __sfr ADCBUF14;

__at(0x0E62) __sfr ADCBUF14L;

__at(0x0E63) __sfr ADCBUF14H;

__at(0x0E64) __sfr ADCBUF15;

__at(0x0E64) __sfr ADCBUF15L;

__at(0x0E65) __sfr ADCBUF15H;

__at(0x0E66) __sfr ADCBUF16;

__at(0x0E66) __sfr ADCBUF16L;

__at(0x0E67) __sfr ADCBUF16H;

__at(0x0E68) __sfr ADCBUF17;

__at(0x0E68) __sfr ADCBUF17L;

__at(0x0E69) __sfr ADCBUF17H;

__at(0x0E6A) __sfr ADCBUF18;

__at(0x0E6A) __sfr ADCBUF18L;

__at(0x0E6B) __sfr ADCBUF18H;

__at(0x0E6C) __sfr ADCBUF19;

__at(0x0E6C) __sfr ADCBUF19L;

__at(0x0E6D) __sfr ADCBUF19H;

__at(0x0E6E) __sfr ADCBUF20;

__at(0x0E6E) __sfr ADCBUF20L;

__at(0x0E6F) __sfr ADCBUF20H;

__at(0x0E70) __sfr ADCBUF21;

__at(0x0E70) __sfr ADCBUF21L;

__at(0x0E71) __sfr ADCBUF21H;

__at(0x0E72) __sfr ADCBUF22;

__at(0x0E72) __sfr ADCBUF22L;

__at(0x0E73) __sfr ADCBUF22H;

__at(0x0E74) __sfr ADCBUF23;

__at(0x0E74) __sfr ADCBUF23L;

__at(0x0E75) __sfr ADCBUF23H;

__at(0x0E76) __sfr ADCBUF24;

__at(0x0E76) __sfr ADCBUF24L;

__at(0x0E77) __sfr ADCBUF24H;

__at(0x0E78) __sfr ADCBUF25;

__at(0x0E78) __sfr ADCBUF25L;

__at(0x0E79) __sfr ADCBUF25H;

__at(0x0E7A) __sfr ADCTMUEN0L;
__at(0x0E7A) volatile __ADCTMUEN0Lbits_t ADCTMUEN0Lbits;

__at(0x0E7B) __sfr ADCTMUEN0H;
__at(0x0E7B) volatile __ADCTMUEN0Hbits_t ADCTMUEN0Hbits;

__at(0x0E7C) __sfr ADCTMUEN1L;
__at(0x0E7C) volatile __ADCTMUEN1Lbits_t ADCTMUEN1Lbits;

__at(0x0E7D) __sfr ADCTMUEN1H;
__at(0x0E7D) volatile __ADCTMUEN1Hbits_t ADCTMUEN1Hbits;

__at(0x0E7E) __sfr ADCHIT0L;
__at(0x0E7E) volatile __ADCHIT0Lbits_t ADCHIT0Lbits;

__at(0x0E7F) __sfr ADCHIT0H;
__at(0x0E7F) volatile __ADCHIT0Hbits_t ADCHIT0Hbits;

__at(0x0E80) __sfr ADCHIT1L;
__at(0x0E80) volatile __ADCHIT1Lbits_t ADCHIT1Lbits;

__at(0x0E81) __sfr ADCHIT1H;
__at(0x0E81) volatile __ADCHIT1Hbits_t ADCHIT1Hbits;

__at(0x0E82) __sfr ADCSS0L;
__at(0x0E82) volatile __ADCSS0Lbits_t ADCSS0Lbits;

__at(0x0E83) __sfr ADCSS0H;
__at(0x0E83) volatile __ADCSS0Hbits_t ADCSS0Hbits;

__at(0x0E84) __sfr ADCSS1L;
__at(0x0E84) volatile __ADCSS1Lbits_t ADCSS1Lbits;

__at(0x0E85) __sfr ADCSS1H;
__at(0x0E85) volatile __ADCSS1Hbits_t ADCSS1Hbits;

__at(0x0E86) __sfr ADCHS0L;
__at(0x0E86) volatile __ADCHS0Lbits_t ADCHS0Lbits;

__at(0x0E87) __sfr ADCHS0H;
__at(0x0E87) volatile __ADCHS0Hbits_t ADCHS0Hbits;

__at(0x0E88) __sfr ADCON5L;
__at(0x0E88) volatile __ADCON5Lbits_t ADCON5Lbits;

__at(0x0E89) __sfr ADCON5H;
__at(0x0E89) volatile __ADCON5Hbits_t ADCON5Hbits;

__at(0x0E8A) __sfr ADCON3L;
__at(0x0E8A) volatile __ADCON3Lbits_t ADCON3Lbits;

__at(0x0E8B) __sfr ADCON3H;
__at(0x0E8B) volatile __ADCON3Hbits_t ADCON3Hbits;

__at(0x0E8C) __sfr ADCON2L;
__at(0x0E8C) volatile __ADCON2Lbits_t ADCON2Lbits;

__at(0x0E8D) __sfr ADCON2H;
__at(0x0E8D) volatile __ADCON2Hbits_t ADCON2Hbits;

__at(0x0E8E) __sfr LCDDATA0;
__at(0x0E8E) volatile __LCDDATA0bits_t LCDDATA0bits;

__at(0x0E8F) __sfr LCDDATA1;
__at(0x0E8F) volatile __LCDDATA1bits_t LCDDATA1bits;

__at(0x0E90) __sfr LCDDATA2;
__at(0x0E90) volatile __LCDDATA2bits_t LCDDATA2bits;

__at(0x0E91) __sfr LCDDATA3;
__at(0x0E91) volatile __LCDDATA3bits_t LCDDATA3bits;

__at(0x0E92) __sfr LCDDATA4;
__at(0x0E92) volatile __LCDDATA4bits_t LCDDATA4bits;

__at(0x0E93) __sfr LCDDATA5;
__at(0x0E93) volatile __LCDDATA5bits_t LCDDATA5bits;

__at(0x0E94) __sfr LCDDATA6;
__at(0x0E94) volatile __LCDDATA6bits_t LCDDATA6bits;

__at(0x0E95) __sfr LCDDATA7;
__at(0x0E95) volatile __LCDDATA7bits_t LCDDATA7bits;

__at(0x0E96) __sfr LCDDATA8;
__at(0x0E96) volatile __LCDDATA8bits_t LCDDATA8bits;

__at(0x0E97) __sfr LCDDATA9;
__at(0x0E97) volatile __LCDDATA9bits_t LCDDATA9bits;

__at(0x0E98) __sfr LCDDATA10;
__at(0x0E98) volatile __LCDDATA10bits_t LCDDATA10bits;

__at(0x0E99) __sfr LCDDATA11;
__at(0x0E99) volatile __LCDDATA11bits_t LCDDATA11bits;

__at(0x0E9A) __sfr LCDDATA12;
__at(0x0E9A) volatile __LCDDATA12bits_t LCDDATA12bits;

__at(0x0E9B) __sfr LCDDATA13;
__at(0x0E9B) volatile __LCDDATA13bits_t LCDDATA13bits;

__at(0x0E9C) __sfr LCDDATA14;
__at(0x0E9C) volatile __LCDDATA14bits_t LCDDATA14bits;

__at(0x0E9D) __sfr LCDDATA15;
__at(0x0E9D) volatile __LCDDATA15bits_t LCDDATA15bits;

__at(0x0E9E) __sfr LCDDATA16;
__at(0x0E9E) volatile __LCDDATA16bits_t LCDDATA16bits;

